modules/admin/controllers/ProductAttributesController.php

SELECT * FROM `product` WHERE `id`='12'
---
    public function actionUpdate($productId, $attributeId)
    {
        $model = $this->findModel($productId, $attributeId);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(Yii::$app->user->returnUrl);
        } else {
            $model->productId = $productId;
            $product = ProductModel::find()->where(['id' => $productId])->one();

SELECT * FROM `productAttributes` WHERE (`productId`='12') AND (`attributeId`='7')
---
    protected function findModel($productId, $attributeId)
    {
        if (($model = ProductAttributeModel::findOne(['productId' => $productId, 'attributeId' => $attributeId])) !== null) {