modules/admin/controllers/ProductController.php

INSERT INTO `product` (`photo`, `name`, `description`, `categoryId`, `price`, `quantity`) VALUES ('web/files/851_db_file_img_138_640xauto.jpg', 'Black skirt', 'Black skirt for women.', 1, '1250', 10)
---
    public function actionCreate()
    {
        $model = new ProductModel();
        if (isset($_FILES['ProductModel']) && $_FILES['ProductModel']['name']['photo'] != "") {
            if (!in_array($_FILES['ProductModel']['type']['photo'], $this->image_array))
                $model->addError('photo', 'Allowed file extensions: jpg, gif, png.');
            else {
                $rnd = rand(0, 9999);
                $uploadedFile = UploadedFile::getInstance($model, 'photo');
                $fileName = 'web/files/' . $rnd . '_' . $uploadedFile->name;
                $model->photo = $fileName;
                Yii::info($model->photo);
                $uploadedFile->saveAs($fileName);
            }
        }

        if ($model->load(Yii::$app->request->post()) && $model->save(false)) {

SELECT * FROM `product` WHERE `id`='8'
---
    protected function findModel($id)
    {
        if (($model = ProductModel::findOne($id)) !== null) {