modules/user/controllers/CartController.php

INSERT INTO `order` (`userId`, `date`) VALUES (9, '2014-12-16 04:03:57')
SELECT * FROM `product` WHERE `id`='12'
INSERT INTO `orderlistitem` (`orderId`, `productId`, `quantity`, `cost`) VALUES (22, 12, 1, '1500')
---
    public function actionMakeOrder()
    {
        if (count($_SESSION['cart_items']) != 0) {
            $order = new OrderModel();
            $order->userId = Yii::$app->user->getIdentity()->getId();
            $order->date = date("Y-m-d H:i:s");
            Yii::info("order prepared");
            if ($order->save(false)) {
                Yii::info("order saved");
                $cost = 0;
                foreach ($_SESSION['cart_items'] as $key => $value) {
                    $item = new OrderListItemModel();
                    $item->orderId = $order->id;
                    $item->productId = $value['id'];
                    $item->quantity = $value['quantity'];
                    $item->cost = ProductModel::find()->where(['id' => $value['id']])->one()->price;
                    Yii::info("$item->orderId  $item->productId  $item->quantity  $item->cost");
                    if ($item->save(false)) {