modules/user/controllers/CatalogController.php

    public function actionView($id)
    {
        $product = ProductModel::find()->where(['id' => $id])->one();
---
SELECT * FROM `product` WHERE `id`='13'