modules/user/controllers/OrderController.php

SELECT * FROM `order` WHERE `userId`=9
---
    public function actionIndex()
    {

        $orders = OrderModel::find()->where(['userId' => Yii::$app->user->getIdentity()->getId()])->all();