modules/user/views/order/index.php

                    <?php
                    echo GridView::widget([
                        'dataProvider' => $items[$i],
                        'columns' => [
                            [
                                'attribute' => 'Name',
                                'value' => function ($model) {
                                    return ProductModel::find()->where(['id' => $model['productId']])->one()->name;
                                },
                            ],
                            'quantity',
                            'orderId',
                        ],
---
SELECT * FROM `product` WHERE `id`='8'