modules/admin/views/product/_form.php

SELECT * FROM `category`
---

    <?= $form->field($model, 'description')->textInput(['maxlength' => 1000]) ?>

    <?= $form->field($model, 'categoryId')->dropDownList(ArrayHelper::map(CategoryModel::find()->all(), 'id', 'name'))->label('Category') ?>