models/ProductAttributeModel.php

    public function getOtherAttributes($productId)
    {
        return AttributeModel::find()->where('id != :attributeId', ['attributeId' => 'attributeId'])->viaTable('{productAttributes}', ['productId' => $productId])->asArray()->all();
---
SELECT * FROM `attribute` WHERE `id`=10