models/ProductModel.php

SELECT * FROM `attribute` WHERE `categoryId`='1'
INSERT INTO `productAttributes` (`productId`, `value`, `attributeId`) VALUES (13, ' ', 10)
---
    public function createAttributes()
    {
        $attributes = AttributeModel::find()->where(['categoryId' => $this->categoryId])->all();
        for ($i = 0; $i < count($attributes); $i++) {
            $productAttribute = new ProductAttributeModel();
            $productAttribute->productId = $this->id;
            $productAttribute->value = " ";
            $productAttribute->attributeId = $attributes[$i]->id;
            Yii::info($productAttribute->productId . "  " . $productAttribute->value . "  " . $productAttribute->attributeId);
            $productAttribute->insert(false);

SELECT MAX(price) FROM `product` WHERE `categoryId`='1'
---
    public static function findMaxPrice($categoryId)
    {
        return ProductModel::find()->where(['categoryId' => $categoryId])->max('price');