models/UserModel.php

    public static function findByEmail($email)
    {
        $user = UserModel::find()->where(['email' => $email])->one();
---
SELECT * FROM `user` WHERE `email`='ivan@gmail.com'

    public static function findIdentity($id)
    {
        $identity = UserModel::find()->where(['id' => $id])->one();
---
SELECT * FROM `user` WHERE `id`=9